mixly/SMeshStudio/smeshcore/hardware/mbed/boards.txt
xbed_nrf51822_gcc_arm.recipe.objcopy.bin.pattern="{runtime.ide.path}/tools/utils/srec_cat" "{runtime.ide.path}/hardware/mbed/variants/xbed1.0_nrf51822_gcc_arm/hal/TARGET_NORDIC/TARGET_NRF51822/Lib/s110_nrf51822_7_0_0/s110_nrf51822_7.0.0_softdevice.hex" -intel "{build.path}/{build.project_name}.hex" -intel -o combined.hex -intel --line-length=44

xbed_nrf51822_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

###################################################################################################################
mbed_kl05z_gcc_arm.name=Freescale FRDM-KL05Z mbed boards by gcc_arm
mbed_kl05z_gcc_arm.upload.protocol=copy
mbed_kl05z_gcc_arm.upload.tool=mbed_cp
mbed_kl05z_gcc_arm.build.mcu=cortex-m0plus
#mbed_kl05z_gcc_arm.build.cpu=Mkl05z128VLK4

mbed_kl05z_gcc_arm.build.architecture=arm-none-eabi
mbed_kl05z_gcc_arm.build.command.as=arm-none-eabi-as
mbed_kl05z_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_kl05z_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_kl05z_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_kl05z_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_kl05z_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_kl05z_gcc_arm.build.command.size=arm-none-eabi-size

mbed_kl05z_gcc_arm.build.core=mbed
mbed_kl05z_gcc_arm.build.variant=mbed_kl05z_gcc_arm


mbed_kl05z_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m0plus -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer  -Wno-unused-function -Wno-unused-variable
mbed_kl05z_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_kl05z_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_kl05z_gcc_arm.build.CC_SYMBOLS = -DTARGET_KL05Z -DTARGET_M0P -DTARGET_Freescale -DTARGET_KLXX -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0PLUS -DARM_MATH_CM0PLUS -DMBED_BUILD_TIMESTAMP=1414314164.72 -D__MBED__=1 -DTARGET_FF_ARDUINO 
mbed_kl05z_gcc_arm.build.LD_FLAGS =   -mcpu=cortex-m0plus -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_kl05z_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_kl05z_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_kl05z_gcc_arm/cmsis/TARGET_Freescale/TARGET_KLXX/TARGET_kl05z/TOOLCHAIN_GCC_ARM/Mkl05Z4.ld

mbed_kl05z_gcc_arm.build.use_archiver=false
mbed_kl05z_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_kl05z_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_kl05z_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_kl05z_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_kl05z_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_kl05z_gcc_arm/cmsis/TARGET_Freescale/TARGET_KLXX/TARGET_kl05z/TOOLCHAIN_GCC_ARM" {build.LD_SYS_LIBS}
mbed_kl05z_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_kl05z_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_kl05z_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
###################################################################################################################
mbed_lpc11u68_gcc_arm.name=mbed lpc11u68 LPCXpresso make by gcc_arm and upload by copy
mbed_lpc11u68_gcc_arm.upload.protocol=copy
mbed_lpc11u68_gcc_arm.upload.tool=mbed_cp
mbed_lpc11u68_gcc_arm.build.mcu=cortex-m0
mbed_lpc11u68_gcc_arm.build.cpu=lpc11u68

mbed_lpc11u68_gcc_arm.build.architecture=arm-none-eabi
mbed_lpc11u68_gcc_arm.build.command.as=arm-none-eabi-as
mbed_lpc11u68_gcc_arm.build.command.gcc=arm-none-eabi-gcc
mbed_lpc11u68_gcc_arm.build.command.g++=arm-none-eabi-g++
mbed_lpc11u68_gcc_arm.build.command.ar=arm-none-eabi-ar
mbed_lpc11u68_gcc_arm.build.command.objcopy=arm-none-eabi-objcopy
mbed_lpc11u68_gcc_arm.build.command.objdump=arm-none-eabi-objdump
mbed_lpc11u68_gcc_arm.build.command.size=arm-none-eabi-size

mbed_lpc11u68_gcc_arm.build.core=mbed
mbed_lpc11u68_gcc_arm.build.variant=mbed_lpc11u68_gcc_arm

mbed_lpc11u68_gcc_arm.build.CC_FLAGS= -mcpu=cortex-m0 -mthumb  -c -g -fno-common -fmessage-length=0 -Wall -fno-exceptions -ffunction-sections -fdata-sections -fomit-frame-pointer  -Wno-unused-function -Wno-unused-variable -MMD -MP
mbed_lpc11u68_gcc_arm.build.ONLY_C_FLAGS= -std=gnu99
mbed_lpc11u68_gcc_arm.build.ONLY_CPP_FLAGS= -std=gnu++98 -fno-rtti
mbed_lpc11u68_gcc_arm.build.CC_SYMBOLS = -DTARGET_lpc11u68 -DTARGET_M0 -DTARGET_NXP -DTARGET_LPC11U6X -DTOOLCHAIN_GCC_ARM -DTOOLCHAIN_GCC -D__CORTEX_M0 -DARM_MATH_CM0 -DMBED_BUILD_TIMESTAMP=1414315787.71 -D__MBED__=1 -DTARGET_FF_ARDUINO 
mbed_lpc11u68_gcc_arm.build.LD_FLAGS =  -mcpu=cortex-m0 -mthumb -Wl,--gc-sections --specs=nano.specs -u _printf_float -u _scanf_float
mbed_lpc11u68_gcc_arm.build.LD_SYS_LIBS =  -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys

mbed_lpc11u68_gcc_arm.build.ldscript=hardware/mbed/variants/mbed_lpc11u68_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC11U6X/TOOLCHAIN_GCC_ARM/TARGET_LPC11U68/LPC11U68.ld

mbed_lpc11u68_gcc_arm.build.use_archiver=false
mbed_lpc11u68_gcc_arm.recipe.S.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_lpc11u68_gcc_arm.recipe.c.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_C_FLAGS}   {includes} "{source_file}" -o "{object_file}"
mbed_lpc11u68_gcc_arm.recipe.cpp.o.pattern="{compiler.gcc_arm.path}arm-none-eabi-g++" {build.CC_FLAGS} {build.CC_SYMBOLS} {build.ONLY_CPP_FLAGS} {includes} "{source_file}" -o "{object_file}"
mbed_lpc11u68_gcc_arm.recipe.ar.pattern="{compiler.gcc_arm.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
mbed_lpc11u68_gcc_arm.recipe.c.combine.pattern="{compiler.gcc_arm.path}arm-none-eabi-gcc" {build.LD_FLAGS}  "-T{runtime.ide.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -L"{runtime.ide.path}/hardware/mbed/variants/mbed_lpc11u68_gcc_arm/cmsis/TARGET_NXP/TARGET_LPC11U6X/TOOLCHAIN_GCC_ARM/TARGET_LPC11U68" {build.LD_SYS_LIBS}
mbed_lpc11u68_gcc_arm.recipe.objcopy.bin.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Obinary "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.bin"
mbed_lpc11u68_gcc_arm.recipe.objcopy.hex.pattern="{compiler.gcc_arm.path}arm-none-eabi-objcopy"  -Oihex "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex"
mbed_lpc11u68_gcc_arm.recipe.size.pattern="{compiler.gcc_arm.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
